#coding=utf-8


#-------------------------------------------------------------------------
# 测试 git push --set-upstream origin master 后能否直接 git push
#-------------------------------------------------------------------------










#-------------------------------------------------------------------------
# 测试 Ctrl + Shift + L可以将当前选中区域打散，然后进行同时编辑，
# 有打散自然就有合并，Ctrl + J可以把当前选中区域合并为一行
#-------------------------------------------------------------------------
# values = ['awer', 'b', 'c', 'd', 'e ', 'f ', 'g']










#-------------------------------------------------------------------------
# 测试代码提示 -- SublimeCodeIntel
#-------------------------------------------------------------------------
# a = '123123123123'
# print a.endswith('\n')












#-------------------------------------------------------------------------
# 测试字符串长度，去掉行尾'\n'
#-------------------------------------------------------------------------
# a = '123\n'
# print len(a)
# b = a[0:len(a)-1]
# print b
# print len(b)













#-------------------------------------------------------------------------
# 测试打开一个文本文件，如何在文件尾加入一个空行
#-------------------------------------------------------------------------
# f = open(r'C:\Users\gWX289620\Desktop\123.txt')
# lines = f.readlines()
# f.close()
# i = 0
# for line in lines:
# 	i += 1
# 	print str(i) + ":"
# 	print line
# 	if '\n' in line:
# 		print "yes"
# 	else:
# 		print "no"	














#-------------------------------------------------------------------------
# 测试如何判断一个变量是否定义
#-------------------------------------------------------------------------
# print dir()

# assert not 'awer' in dir()

# if 'awer' in dir():
# 	print 'awer is def'
# else:
# 	print 'awer is not def'

# awer = ''

# if 'awer' in dir():
# 	print 'awer is def'
# else:
# 	print 'awer is not def'

# print dir()
